class HrivnaHumanizer
   SIMPLE_NUM = [ "", "одна", "дві", "три", "чотири", "п'ять", "шість", "сім", "вісім", "дев'ять",
                 "десять", "одинадцять", "дванадцять", "тринадцять", "чотирнадцять", "п'ятнадцять", "шістнадцять", "сімнадцять", 
                 "вісімнадцять", "дев'ятнадцять" ]
    DOZENS    = [ "", "десять", "двадцять", "тридцять", "сорок", "пятдесят", "шістдесят", "сімдесят", "вісімдесят", "дев'яносто" ]
    HUNDREDS  = [ "", "сто", "двісті", "триста", "чотириста", "п'ятсот", "шістсот", "сімсот", "вісімсот", "дев'ятсот" ]
    THOUSANDS = [ "тисяч", "тисяча", "тисячі", "тисячі", "тисячі", "тисяч", "тисяч", "тисяч", "тисяч", "тисяч" ]
    MILLIONS  =  ["мільйонів","мільйон","мільйони","мільйони", "мільйони", "мільйонів", "мільйонів", "мільйонів", "мільйонів", "мільйонів"]

   def initialize(sum)
      @sum = sum
   end

   def to_str
    
  end
end